Revit 2027 API
ExternalEvent Properties
The ExternalEvent type exposes the following members.
Properties
Name | Description
IsPending |  Checking whether an event has been raised but not yet executed.
Top
See Also
Reference
ExternalEvent Class
Autodesk.Revit.UI Namespace